block.org
* Block
  :PROPERTIES:
  :SLIDE:    segue dark quote
  :ASIDE:    right bottom
  :ARTICLE:  flexbox vleft auto-fadein
  :END:

** Code Block
A source block looks like this:
#+BEGIN_SRC emacs-lisp
  (def hello-world ()
       (message "hello world!"))
#+END_SRC
- Just type =<s= in a newline, then press =[TAB]= to expand to =#+BEGIN_SRC ... #+END_SRC=.
- Remember to specify the language name (e.g. =emacs-lisp=).
#+BEGIN_SRC org
,#+BEGIN_SRC emacs-lisp
  (def hello-world ()
       (message "hello world!"))
,#+END_SRC
#+END_SRC

** Highlight in Code Block
  :PROPERTIES:
  :ARTICLE:  smaller
  :END:
- Press =h= to highlight the code.
- Simply wrap the area you want with *=<b> ... </b>=* in source block.
#+BEGIN_SRC emacs-lisp
(defun org-ioslide-quote-block (quote-block contents info)
  (let* ((parent (org-export-get-parent-headline quote-block))
	 (slide-prop (org-element-property :SLIDE parent))
	 <b>(--make-sign (function (lambda (string)
			   (replace-regexp-in-string
			    "^ *\\(&#x201[34];\\)\\(.+\\)\\(<br */>\\|\n\\)"
			    "<span class='float-right'>\\1\\2</span>\\3" string))))</b>)
    (if (and slide-prop (string-match "segue" slide-prop))
	(format "<q>\n%s</q>"
		   <b>(funcall --make-sign contents)</b>)
      (format "<blockquote>\n%s</blockquote>"
	      (save-match-data
		(replace-regexp-in-string
		 "</span>\n</p>"
		 "</span><br  />\n</p>"
		 <b>(funcall --make-sign contents)</b>))))))
#+END_SRC

** Quote Block
  :PROPERTIES:
  :ARTICLE:  smaller
  :END:
Type =<q= in a newline, then press =[TAB]= to expand to a quote block (Use =\\= to break line forcely.):
#+BEGIN_QUOTE
一個人因為講實話而成為英雄，換句話說是整個社會都在說謊。\\
一人は真実を言うだけからヒーローになる。換言すれば、この社会は全部が嘘
している。\\
If a person is treated as a hero for saying truth, that is the whole
society are lying.\\

      -- 柯文哲 Wen Jei, Ko. (2014)
#+END_QUOTE

#+BEGIN_SRC org
  ,#+BEGIN_QUOTE
  一個人因為講實話而成為英雄，換句話說是整個社會都在說謊。\\
  一人は真実を言うだけからヒーローになる。換言すれば、この社会は全部が嘘
  している。\\
  If a person is treated as a hero for saying truth, that is the whole
  society are lying.\\

        -- 柯文哲 Wen Jei, Ko. (2014)
  ,#+END_QUOTE
#+END_SRC

** Verse Block
  :PROPERTIES:
  :ARTICLE:  smaller
  :END:
Verse block is similar with quote's, but it will keeps line break. Take a poem as example:

#+BEGIN_VERSE
眾里尋他千百度
驀然回首
那人卻在
燈火闌珊處
  -- 辛棄疾〈青玉案〉
#+END_VERSE

#+BEGIN_SRC org
,#+BEGIN_VERSE
眾里尋他千百度
驀然回首
那人卻在
燈火闌珊處
  -- 辛棄疾〈青玉案〉
,#+END_VERSE
#+END_SRC
