docs/block.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-TW" xml:lang="zh-TW">
<head>
<!-- 2017-02-08 Wed 22:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Block 使用教學</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="fatfingererr - www.ffe.tw" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Block 使用教學</h1>
<div id="table-of-contents">
<h2>&#30446;&#37636;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga7666cd">Block</a>
<ul>
<li><a href="#org109f097">Code Block</a></li>
<li><a href="#org356c27b">Highlight in Code Block</a></li>
<li><a href="#orgdf9348c">Quote Block</a></li>
<li><a href="#orge91f3c1">Verse Block</a></li>
</ul>
</li>
</ul>
</div>
</div>
<script src="js/mathjax/MathJax.js?config=TeX-AMS-MML_HTMLorMML,local/local" type="text/javascript"></script>
<div class="right">
<a href="https://www.ffe.tw/series.html" class="fa fa-home"> Blog</a>&nbsp;&nbsp;|&nbsp;&nbsp;
<a href="https://github.com/fatfingererr/note/blob/master/block.org" class="fa fa-github"> GitHub</a>
</div>

<hr  />



<div id="outline-container-orga7666cd" class="outline-2">
<h2 id="orga7666cd">Block</h2>
<div class="outline-text-2" id="text-orga7666cd">
</div>

<div id="outline-container-org109f097" class="outline-3">
<h3 id="org109f097">Code Block</h3>
<div class="outline-text-3" id="text-org109f097">
<p>
A source block looks like this:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>def hello-world <span style="color: #bc6ec5;">()</span>
     <span style="color: #bc6ec5;">(</span>message <span style="color: #2d9574;">"hello world!"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>Just type <code>&lt;s</code> in a newline, then press <code>[TAB]</code> to expand to <code>#+BEGIN_SRC ... #+END_SRC</code>.</li>
<li>Remember to specify the language name (e.g. <code>emacs-lisp</code>).</li>
</ul>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #827591; background-color: #373040;">#+BEGIN_SRC emacs-lisp</span>
<span style="color: #cbc1d5; background-color: #2f2b33;">  </span><span style="color: #4f97d7; background-color: #2f2b33;">(</span><span style="color: #cbc1d5; background-color: #2f2b33;">def hello-world </span><span style="color: #bc6ec5; background-color: #2f2b33;">()</span>
<span style="color: #cbc1d5; background-color: #2f2b33;">       </span><span style="color: #bc6ec5; background-color: #2f2b33;">(</span><span style="color: #cbc1d5; background-color: #2f2b33;">message </span><span style="color: #2d9574; background-color: #2f2b33;">"hello world!"</span><span style="color: #bc6ec5; background-color: #2f2b33;">)</span><span style="color: #4f97d7; background-color: #2f2b33;">)</span>
<span style="color: #827591; background-color: #373040;">#+END_SRC</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org356c27b" class="outline-3">
<h3 id="org356c27b">Highlight in Code Block</h3>
<div class="outline-text-3" id="text-org356c27b">
<ul class="org-ul">
<li>Press <code>h</code> to highlight the code.</li>
<li>Simply wrap the area you want with <b><code>&lt;b&gt; ... &lt;/b&gt;</code></b> in source block.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">org-ioslide-quote-block</span> <span style="color: #bc6ec5;">(</span>quote-block contents info<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let*</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>parent <span style="color: #b1951d;">(</span>org-export-get-parent-headline quote-block<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
   <span style="color: #67b11d;">(</span>slide-prop <span style="color: #b1951d;">(</span>org-element-property <span style="color: #4f97d7;">:SLIDE</span> parent<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
   &lt;b&gt;<span style="color: #67b11d;">(</span>--make-sign <span style="color: #b1951d;">(</span>function <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">lambda</span> <span style="color: #bc6ec5;">(</span>string<span style="color: #bc6ec5;">)</span>
         <span style="color: #bc6ec5;">(</span>replace-regexp-in-string
          <span style="color: #2d9574;">"^ *</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">(</span><span style="color: #2d9574;">&amp;#x201[34];</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">)</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">(</span><span style="color: #2d9574;">.+</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">)</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">(</span><span style="color: #2d9574;">&lt;br */&gt;</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">|</span><span style="color: #2d9574;">\n</span><span style="color: #2d9574; font-weight: bold;">\\</span><span style="color: #2d9574; font-weight: bold;">)</span><span style="color: #2d9574;">"</span>
          <span style="color: #2d9574;">"&lt;span class='float-right'&gt;\\1\\2&lt;/span&gt;\\3"</span> string<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>&lt;/b&gt;<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>and slide-prop <span style="color: #b1951d;">(</span>string-match <span style="color: #2d9574;">"segue"</span> slide-prop<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
  <span style="color: #67b11d;">(</span>format <span style="color: #2d9574;">"&lt;q&gt;\n%s&lt;/q&gt;"</span>
       &lt;b&gt;<span style="color: #b1951d;">(</span>funcall --make-sign contents<span style="color: #b1951d;">)</span>&lt;/b&gt;<span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span>format <span style="color: #2d9574;">"&lt;blockquote&gt;\n%s&lt;/blockquote&gt;"</span>
        <span style="color: #b1951d;">(</span><span style="color: #4f97d7; font-weight: bold;">save-match-data</span>
    <span style="color: #4f97d7;">(</span>replace-regexp-in-string
     <span style="color: #2d9574;">"&lt;/span&gt;\n&lt;/p&gt;"</span>
     <span style="color: #2d9574;">"&lt;/span&gt;&lt;br  /&gt;\n&lt;/p&gt;"</span>
     &lt;b&gt;<span style="color: #bc6ec5;">(</span>funcall --make-sign contents<span style="color: #bc6ec5;">)</span>&lt;/b&gt;<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf9348c" class="outline-3">
<h3 id="orgdf9348c">Quote Block</h3>
<div class="outline-text-3" id="text-orgdf9348c">
<p>
Type <code>&lt;q</code> in a newline, then press <code>[TAB]</code> to expand to a quote block (Use <code>\\</code> to break line forcely.):
</p>
<blockquote>
<p>
一個人因為講實話而成為英雄，換句話說是整個社會都在說謊。<br  />
一人は真実を言うだけからヒーローになる。換言すれば、この社会は全部が嘘
している。<br  />
If a person is treated as a hero for saying truth, that is the whole
society are lying.<br  />
</p>

<p>
&#x2013; 柯文哲 Wen Jei, Ko. (2014)
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #827591; background-color: #373040;">#+BEGIN_QUOTE</span>
&#19968;&#20491;&#20154;&#22240;&#28858;&#35611;&#23526;&#35441;&#32780;&#25104;&#28858;&#33521;&#38596;&#65292;&#25563;&#21477;&#35441;&#35498;&#26159;&#25972;&#20491;&#31038;&#26371;&#37117;&#22312;&#35498;&#35594;&#12290;\\
&#19968;&#20154;&#12399;&#30495;&#23455;&#12434;&#35328;&#12358;&#12384;&#12369;&#12363;&#12425;&#12498;&#12540;&#12525;&#12540;&#12395;&#12394;&#12427;&#12290;&#25563;&#35328;&#12377;&#12428;&#12400;&#12289;&#12371;&#12398;&#31038;&#20250;&#12399;&#20840;&#37096;&#12364;&#22040;
&#12375;&#12390;&#12356;&#12427;&#12290;\\
If a person is treated as a hero for saying truth, that is the whole
society are lying.\\

      -- &#26607;&#25991;&#21746; Wen Jei, Ko. (2014)
<span style="color: #827591; background-color: #373040;">#+END_QUOTE</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge91f3c1" class="outline-3">
<h3 id="orge91f3c1">Verse Block</h3>
<div class="outline-text-3" id="text-orge91f3c1">
<p>
Verse block is similar with quote's, but it will keeps line break. Take a poem as example:
</p>

<p class="verse">
眾里尋他千百度<br  />
驀然回首<br  />
那人卻在<br  />
燈火闌珊處<br  />
&#xa0;&#xa0;&#x2013; 辛棄疾〈青玉案〉<br  />
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #827591; background-color: #373040;">#+BEGIN_VERSE</span>
&#30526;&#37324;&#23563;&#20182;&#21315;&#30334;&#24230;
&#39488;&#28982;&#22238;&#39318;
&#37027;&#20154;&#21371;&#22312;
&#29128;&#28779;&#38348;&#29642;&#34389;
  -- &#36763;&#26820;&#30142;&#12296;&#38738;&#29577;&#26696;&#12297;
<span style="color: #827591; background-color: #373040;">#+END_VERSE</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">&#26085;&#26399;: 2017-02-08</p>
<p class="author">&#20316;&#32773;: fatfingererr - www.ffe.tw</p>
<p class="date">Created: 2017-02-08 Wed 22:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
